books/The Pragmatic Programmer.html
---
layout: notes
---

<p>
<i>The Pragmatic Programmer From Journeyman to Master</i> – Andrew Hunt and David
Thomas
</p>

<p>
This book changed the way I work. Really small notes based on my last read.
There is nice resume of all the important points already available with the book
</p>

<p>
A pragmatic programmer is
</p>

<ul class="org-ul">
<li>Inquisitive -&gt; Know how things work
</li>
<li>Critical Thinker
</li>
<li>Realistic
</li>
<li>Jack of all trades
</li>
</ul>

<p>
Kaisen: Continuously make small improvements
</p>

<p>
Be a catalyst for change: start something and when people marvel about it say
“Of course it would be better with…”
</p>

<p>
Participate in local users group
</p>

<p>
WISDOM:
*W*hat do you want? What is their *I*nterest in what you've got to say? How
*S*ophisticated are they? How much *D*etail do they want? Whom do you want to
*O*wn the information? How can you *M*otivate them to listen to you?
</p>

<p>
Bad code requires comment -&gt; learned this from Refactoring book and DHH
</p>

<p>
Use accessors to read and write attrs of objects -&gt; easier to add
functionalities
</p>

<p>
Tracer bullets apply particularly to new projects
</p>

<p>
Make sure to say your prototype is meant to be disposable
</p>

<p>
When asked for an estimate say: “I'll get back to you”
</p>

<p>
Law of demeter: Any method of an object should call only methods belonging to
</p>
<ul class="org-ul">
<li>Itself
</li>
<li>Objects it created
</li>
<li>Any directly held component objects
</li>
</ul>

<p>
Algorithm speed:
</p>
<ul class="org-ul">
<li>Loops: O(n)
</li>
<li>Nested Loops: O(nxn)
</li>
<li>Binary chop: O(log(n))
</li>
<li>Divide and conquer: O(nlog(n))
</li>
</ul>
